Autodesk.Revit.DB.FamilySymbolFilter.FamilyId
The family id.
Since:
2011

Autodesk.Revit.DB.FamilySymbolFilter.#ctor(Autodesk.Revit.DB.ElementId)
Constructs a new instance of a filter to find all family symbols of the given family.
familyId:
The family id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The familyId is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FamilySymbolFilter
A filter used to find all family symbols of the given family.
Remarks:
This filter is a quick filter.
Quick filters operate only on the ElementRecord, a low-memory class which has
a limited interface to read element properties. Elements which are rejected
by a quick filter will not be expanded in memory.
Note that it may be faster to get a list of symbol ids from
Autodesk.Revit.DB.Family.GetFamilySymbolIds
rather than to iterate all of the contents of a document with this filter applied.
Since:
2011